{
    "zadaci": [
        {
            "z": "Izdvojiti podatke o svim predmetima.",
            "r": [
                "SELECT * <br>FROM DA.PREDMET"
            ],
            "n": "SELECT * - izdvjamo sve kolone. FROM - odakle izdvajamo kolone."
        },

        {
            "z": "Izdvojiti podatke o svim studentima rođenim u Beogradu.",
            "r": [
                "SELECT *<br>FROM DA.DOSIJE<br>WHERE mestorodjenja = 'Beograd';"
            ],
            "n": "WHERE - uslovi koje treba da zadovolje dobijeni redovi. Stringovi se navode pod jednostrukim navodnicima."
        },

        {
            "z": "Izdvojiti podatke o svim studentima koji su rođeni u Beogradu ili Zrenjaninu.",
            "r": [
                "SELECT *<br>FROM DA.DOSIJE<br>WHERE MESTORODJENJA <> 'Beograd';",
                "SELECT *<br>FROM DA.DOSIJE<br>WHERE NOT MESTORODJENJA = 'Beograd';"
            ]
        },

        {
            "z": "Izdvojiti podatke o svim studentima koji su rođeni u Beogradu ili Zrenjaninu.",
            "r": [
                "SELECT *<br>FROM DA.DOSIJE<br>WHERE MESTORODJENJA = 'Beograd' OR MESTORODJENJA = 'Zrenjanin';"
            ]
        },

        {
            "z": "Izdvojiti podatke o svim studentkinjama rođenim u Beogradu.",
            "r": [
                "SELECT *<br>FROM DA.DOSIJE<br>WHERE MESTORODJENJA = 'Beograd' AND POL = 'z';"
            ]
        },

        {
            "z": "Izdvojiti nazive mesta u kojima su rođeni studenti.",
            "r": [
                "SELECT DISTINCT MESTORODJENJA<br>FROM DA.DOSIJE;"
            ],
            "n": "DISTINCT stavljamo kada ne želimo duplirane redove, probati i bez DISTINCT."
        },

        {
            "z": "Izdvojiti nazive predmeta koji imaju više od 6 ESPB.",
            "r": [
                "SELECT NAZIV, ESPB<br>FROM DA.PREDMET<br>WHERE ESPB>6;"
            ]
        },

        {
            "z": "Izdvojiti oznake i nazive predmeta koji imaju između 8 i 15 ESPB.",
            "r": [
                "SELECT NAZIV, ESPB<br>FROM DA.PREDMET<br>WHERE ESPB >= 8 AND ESPB <= 15;",
                "SELECT NAZIV, ESPB <br> FROM DA.PREDMET<br> WHERE ESPB BETWEEN 8 AND 15;<br>"
            ],
            "n": ""
        },


        {
            "z": "Izdvojiti podatke o ispitnim rokovima održanim u 2015/2016, 2016/2017. ili 2018/2019. školskoj godini.",
            "r": [
                " SELECT *<br> FROM DA.SKOLSKAGODINA<br> WHERE SKGODINA=2015 OR SKGODINA=2016 OR SKGODINA=2018;",
                "SELECT *<br> FROM DA.SKOLSKAGODINA<br> WHERE SKGODINA IN (2015, 2016, 2018);"
            ],
            "n": "U bazi se čuva manje godina, npr za 2015/2016 u bazi će biti 2015."
        },
        
        {
            "z": "Izdvojiti podatke o ispitnim rokovima koji nisu održani u 2015/2016, 2016/2017. ili 2018/2019. školskoj godini.",
            "r": [
                "SELECT *<br> FROM DA.SKOLSKAGODINA<br> WHERE SKGODINA <> 2015 AND SKGODINA <> 2016 AND SKGODINA <> 2018;",
                "SELECT *<br> FROM DA.SKOLSKAGODINA<br> WHERE SKGODINA NOT IN (2015, 2016, 2018);"
            ],
            "n": ""
        },
        
        {
            "z": "Izdvojiti podatke o studentima koji su fakultet upisali 2015. godine, pod pretpostavkom da godina iz indeksa odgovara godini upisa na fakultet.",
            "r": [
                "SELECT * <br> FROM DA.DOSIJE<br> WHERE INDEKS/10000 = 2015;"
            ],
            "n": ""
        },
        
        {
            "z": "Izdvojiti nazive predmeta i njihovu cenu za samofinansirajuće studente izraženu u dinarima. Jedan ESPB košta 2000 dinara.",
            "r": [
                "SELECT NAZIV, ESPB, ESPB*2000 <br> FROM DA.PREDMET;",
                "SELECT NAZIV, ESPB, ESPB*2000 AS CENA <br> FROM DA.PREDMET;",
                "SELECT NAZIV, ESPB, ESPB*2000 AS \"Cena poena\" <br>FROM DA.PREDMET;"
            ],
            "n": "Ukoliko se ne da ime kolone prikazaće se redni broj kolone, ime se može zadati pod dvostrukim navodnicima ukoliko ima razmak."
        },
        
        {
            "z": "U prethodnom upitu izdvojiti samo redove sa cenom bodova većom od 10 000.",
            "r": [
                "SELECT NAZIV, ESPB, ESPB*2000 AS \"Cena poena\" <br>FROM DA.PREDMET <br> WHERE ESPB*2000 > 10000;"
            ],
            "n": "Ne može \"WHERE CENA>10000\" zbog redosleda izvršavanja. Prvo se izvrši FROM, zatim WHERE, a tek onda SELECT i tada saznajemo za novo ime kolone."
        },
        
        {
            "z": "Izdvojiti nazive predmeta i njihovu cenu za samofinansirajuće studente izraženu u dinarima. Jedan ESPB košta 2000 dinara. Između kolone naziv i kolone cena dodati kolonu u kojoj će za svaku vrstu biti ispisano Cena u dinarima.",
            "r": [
                "SELECT NAZIV as \"naziv predmeta\", 'cena u dinarima' as \"opis\", ESPB*2000 AS CENA <br>FROM DA.PREDMET"
            ],
            "n": "String konstanta koja ide u svaku ćeliju kolone kao i string konstante se navode pod jednostrukim navodnicima, a naziv kolone pod dvostrukim."
        },
        
        {
            "z": "Izdvojiti podatke o studentima koji su rođeni u mestu čiji naziv sadrži malo slovo o kao drugo slovo.",
            "r": [
                "SELECT INDEKS, MESTORODJENJA<br> FROM DA.DOSIJE<br> WHERE MESTORODJENJA LIKE '_o%';"
            ],
            "n": "LIKE 'maska'. Maska može sadržati specijalne karaktere. % - označava da se može nalaziti 0 ili više karaktera."
        },
        
        {
            "z": "Izdvojiti podatke o studentima koji su rođeni u mestu čiji naziv sadrži malo slovo o.",
            "r": [
                "SELECT INDEKS, MESTORODJENJA<br> FROM DA.DOSIJE<br> WHERE MESTORODJENJA LIKE '%o%';"
            ],
            "n": "_ - označava da se na toj poziciji nalazi tačno jedan karakter."
        },
        
        {
            "z": "Izdvojiti podatke o studentima koji su rođeni u mestu čiji naziv se završava sa malo e.",
            "r": [
                "SELECT INDEKS, MESTORODJENJA<br> FROM DA.DOSIJE<br> WHERE MESTORODJENJA LIKE '%e';"
            ],
            "n": "U imenu grada se može nalaziti 0 ili više karaktera (%) pre slova e, a posle e ne ide ništa."
        },
        
        {
            "z": "Izdvojiti podatke o studentima koji su rođeni u mestu čiji naziv počinje sa N a završava sa d.",
            "r": [
                "SELECT INDEKS, MESTORODJENJA<br> FROM DA.DOSIJE<br> WHERE MESTORODJENJA LIKE 'N%d';"
            ],
            "n": "Ime grada počinje sa N, onda ide 0 ili više karaktera (%) pa d na kraju."
        },
        
        {
            "z": "Napraviti masku koja bi mogla da prepozna naredni string \"%x_\"",
            "r": [
                "LIKE '/_x/%' ESCAPE '/'",
                "SELECT * <br>FROM DA.DOSIJE<br> WHERE '_xxx%' LIKE '%/_%/%' ESCAPE '/';"
            ],
            "n": "Nakon ESCAPE se pod jednostrukim navodnicima navodi karakter koji će se koristiti za eskejpovanje (ukoliko u nisci želimo karakter koji je specijalan, % ili _)."
        },
        
        {
            "z": "Izdvojiti podatke o predmetima. Rezultat urediti po ESPB u rastućem poretku.",
            "r": [
                "SELECT * <br> FROM DA.PREDMET <br> ORDER BY ESPB ASC;"
            ],
            "n": "ORDER BY se koristi za sortiranje,umesto imena kolone se može navesti i redni broj kolone, npr ORDER BY 4 ASC. Kolone se broje od 1. ORDER BY se izvršava pre ili posle SELECT, što znači da možemo da korstimo imena kolona koje smo dali u SELECT ali i kolone koje nisu SELECT."
        },
        
        {
            "z": "Izdvojiti podatke o predmetima. Rezultat urediti po ESPB u opadajućem poretku.",
            "r": [
                " SELECT * <br> FROM DA.PREDMET <br> ORDER BY ESPB DESC;"
            ],
            "n": ""
        },
        
        {
            "z": "Izdvojiti podatke o predmetima. Rezultat urediti po ESPB u rastućem poretku i po nazivu u opadajućem poretku",
            "r": [
                " SELECT * <br> FROM DA.PREDMET <br>ORDER BY ESPB ASC, NAZIV DESC;"
            ],
            "n": ""
        },
        
        {
            "z": "Izdvojiti ime, prezime i datum upisa na fakultet za studenate koji su fakultet upisali između 10. jula 2017. i 15.9.2017. godine. Rezultat urediti prema prezimenu studenta.",
            "r": [
                "SELECT IME, PREZIME, DATUPISA <br> FROM DA.DOSIJE<br> WHERE DATUPISA BETWEEN '10.07.2017' AND '15.09.2017'<br> ORDER BY PREZIME;"
            ],
            "n": "Datumi se mogu predstaviti u formatu 'dd.mm.yyyy' kao stringovi. Obratiti pažnju da ne ide tačka posle godine. Datumi se mogu poorediti i sa <, >, <=, >= i =."
        },
        
        {
            "z": "Izdvojiti podatke o studijskim programima čija je predviđena dužina studiranja 3 ili više godina. Izdvojiti oznaku i naziv studijskog programa i broj godina predviđenih za studiranje studijskog programa. Rezultat urediti prema predviđenom broju godina za studiranje i nazivu studijskog programa.",
            "r": [
                "SELECT OZNAKA, NAZIV, OBIMESPB/60 BROJ_GODINA<br>FROM DA.STUDIJSKIPROGRAM<br> WHERE OBIMESPB >= 3*60<br> ORDER BY BROJ_GODINA, NAZIV;"
            ],
            "n": ""
        }

    ],
    "zadaciZaVezbanje":[
        "Izdvojiti indeks, ime i prezime za svakog studenta koji je upisao fakultet.",
        "Izdvojiti sve različite vrednosti u koloni espb u tabeli predmet.",
        "Izdvojiti sva ženska imena studenata.",
        "Izdvojiti podatke o ispitima koji su održani u ispitnom roku sa oznakom jan1 i na kojima je student dobio 100 poena.",
        "Izdvojiti indekse studenata koji su na nekom ispitu dobili između 65 i 87 poena.",
        "Izdvojiti indeks i godinu upisa na fakultet za studente koji fakultet nisu upisali između 2013. i 2016. godine. Kolonu sa godinom upisa nazvati Godina upisa, a kolonu sa indeksom Student. Koristiti pretpostavkom da godina iz indeksa odgovara godini upisa na fakultet.",
        "Izdvojiti indeks i godinu upisa na fakultet za studente koji fakultet nisu upisali između 2013. i 2016. godine. i čije ime počinje na slovo M, treće slovo u imenu je r, a završava se na a. Rezultat urediti prema imenu studenta u rastućem poretku.",
        "Izdvojiti ime i prezime svakog studenta čije ime nije Marko, Veljko ili Ana. Rezultat urediti prema prezimenu u opadajućem poretku, a zatim prema imenu u rastućem poretku."
       ]
}